Revit 2015 API
ElementComparisonResult Enumeration
 Enumerated values of the result of comparing two objects for sorting purposes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2015
Syntax
C#
public enum ElementComparisonResult
Visual Basic
Public Enumeration ElementComparisonResult
Visual C++
public enum class ElementComparisonResult
Members
Member name | Description
Equal |  Two objects being compared are considered equal.
Ordered |  Two objects differ, but are correctly ordered, meaning the first one is smaller than the second one.
Reversed |  Two objects differ and are in reversed order, meaning the first one is bigger than the second one.
Incomparable |  Two objects cannot be compared due to their different type or incompatible nature.
See Also
Autodesk.Revit.DB Namespace